# Importación de librerías y visualización de datos

In [1]:
import pandas as pd

## Visualización de actor

In [2]:
actor = pd.read_csv('../input/actor.csv')

actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [3]:
actor.shape

(200, 4)

In [4]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [5]:
actor['first_name'] += ' ' + actor['last_name']

actor.drop(['last_name'], axis=1, inplace=True)

actor.head()

   actor_id           first_name          last_update
0         1     PENELOPE GUINESS  2006-02-15 04:34:33
1         2        NICK WAHLBERG  2006-02-15 04:34:33
2         3             ED CHASE  2006-02-15 04:34:33
3         4       JENNIFER DAVIS  2006-02-15 04:34:33
4         5  JOHNNY LOLLOBRIGIDA  2006-02-15 04:34:33

Ninguna columna tiene valores nulos, luego no es necesario hacer limpieza de este archivo.

## Visualización de category

In [6]:
category = pd.read_csv('../input/category.csv')

category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [7]:
category.shape

(16, 3)

In [8]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

No contiene valores nulos en las columnas, luego no es necesario hacer limpieza.

## Visualización de old_HDD

In [9]:
old = pd.read_csv('../input/old_HDD.csv')
old

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [10]:
old['first_name'] += ' ' + old['last_name']
old.head()

,first_name,last_name,title,release_year,category_id
0,PENELOPE GUINESS,GUINESS,ACADEMY DINOSAUR,2006,6
1,PENELOPE GUINESS,GUINESS,ANACONDA CONFESSIONS,2006,2
2,PENELOPE GUINESS,GUINESS,ANGELS LIFE,2006,13
3,PENELOPE GUINESS,GUINESS,BULWORTH COMMANDMENTS,2006,10
4,PENELOPE GUINESS,GUINESS,CHEAPER CLYDE,2006,14

In [11]:
old.drop(['last_name'], axis=1, inplace = True)
old.head()

         first_name                  title  release_year  category_id
0  PENELOPE GUINESS       ACADEMY DINOSAUR          2006            6
1  PENELOPE GUINESS   ANACONDA CONFESSIONS          2006            2
2  PENELOPE GUINESS            ANGELS LIFE          2006           13
3  PENELOPE GUINESS  BULWORTH COMMANDMENTS          2006           10
4  PENELOPE GUINESS          CHEAPER CLYDE          2006           14

## Visualización de film

In [13]:
film = pd.read_csv('../input/film.csv')

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [14]:
film.shape

(1000, 13)

In [15]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

Todas las columnas menos "original_language_id" no poseen valores nulos, y esta contiene todos los valores nulos; por lo tanto debemos estudiar qué ocurre aquí.

## Visualización de inventory

In [17]:
inventory = pd.read_csv('../input/inventory.csv')

inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [18]:
inventory.shape

(1000, 4)

In [19]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

Ninguna columna posee valores nulos, luego no es necesario hacer limpieza de datos.

## Visualización de language

In [20]:
language = pd.read_csv('../input/language.csv')

language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [21]:
language.shape

(6, 3)

In [22]:
language.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

No posee valores nulos en ninguna de sus columnas y no es necesario hacer limpieza de datos.

## Visualización de rental

In [23]:
rental = pd.read_csv('../input/rental.csv')

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [24]:
rental.shape

(1000, 7)

In [25]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

No posee valores nulos, luego no es necesario hacer limpieza de datos.

# Limpieza de datos

Como el único dataframe que contiene columnas nulas es film, tenemos que averiguar cuál es la mejor forma de transformar esos valores nulos en no nulos. Es decir, si darles un valor estándar a toda la columna, eliminar la columna, o bien, encontrar algún tipo de relación entre esa columna y el resto de dataframe para la construcción de la base de datos posterior.

Como no es posible encontrar relación alguna con el resto de columnas de los otros archivos csv, entonces eliminamos esa columna.

### Tabla film

In [27]:
#film.drop(['Unnamed: 0'], axis=1, inplace=True)

film['release_year'].unique()

array([2006])

In [28]:
film.to_csv('../output/film.csv')

### Tabla category

Vamos a añadir la categoría 0 para poder completar las columnas en old_HDD y que el modelo sea consistente.

In [29]:
category = category.append({'category_id' : 0}, ignore_index=True)

In [31]:
category = category.fillna('Unknown')
category.head()

   category_id       name          last_update
0          1.0     Action  2006-02-15 04:46:27
1          2.0  Animation  2006-02-15 04:46:27
2          3.0   Children  2006-02-15 04:46:27
3          4.0   Classics  2006-02-15 04:46:27
4          5.0     Comedy  2006-02-15 04:46:27

### Tabla old_HDD

Vamos a añadir a la tabla de old_HDD todos los titulos de films que no se encuentran en estas, pues va a ser la tabla intermediaria entre film y actors. Además, aunque compartan released_year, no podríamos engancharla por ahí poque puede haber varias pelis que se estrenaron el mismo año.

In [32]:
old.head()

         first_name                  title  release_year  category_id
0  PENELOPE GUINESS       ACADEMY DINOSAUR          2006            6
1  PENELOPE GUINESS   ANACONDA CONFESSIONS          2006            2
2  PENELOPE GUINESS            ANGELS LIFE          2006           13
3  PENELOPE GUINESS  BULWORTH COMMANDMENTS          2006           10
4  PENELOPE GUINESS          CHEAPER CLYDE          2006           14

In [33]:
conj = set(list(film['title']))

In [35]:
unicos = list(old['title'].unique())
        
old = old.append([{'title' : i} for i in conj if i not in unicos], ignore_index = True)

#old.drop(['Unnamed: 0'], axis=1, inplace=True)

In [36]:
old['first_name'] = old['first_name'].fillna('Unknown')

old['category_id'] = old['category_id'].fillna(0)

old['release_year'] = old['release_year'].fillna(2006)

In [38]:
old.head()

         first_name                  title  release_year  category_id
0  PENELOPE GUINESS       ACADEMY DINOSAUR        2006.0          6.0
1  PENELOPE GUINESS   ANACONDA CONFESSIONS        2006.0          2.0
2  PENELOPE GUINESS            ANGELS LIFE        2006.0         13.0
3  PENELOPE GUINESS  BULWORTH COMMANDMENTS        2006.0         10.0
4  PENELOPE GUINESS          CHEAPER CLYDE        2006.0         14.0

In [39]:
old.to_csv('../output/old_HDD.csv')

### Tabla actor

In [40]:
actor.to_csv('../output/actor.csv')

In [41]:
actor.head()

   actor_id           first_name          last_update
0         1     PENELOPE GUINESS  2006-02-15 04:34:33
1         2        NICK WAHLBERG  2006-02-15 04:34:33
2         3             ED CHASE  2006-02-15 04:34:33
3         4       JENNIFER DAVIS  2006-02-15 04:34:33
4         5  JOHNNY LOLLOBRIGIDA  2006-02-15 04:34:33

### Tabla rental

In [42]:
rental['inventory_id'] = rental['inventory_id'].apply(lambda x : x%1000)
rental

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,79,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [43]:
rental.to_csv('../output/rental.csv')

# Base de datos SQL en Python

In [47]:
pip install PyMySQL

Collecting PyMySQL
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 309 kB/s eta 0:00:01
Installing collected packages: PyMySQL
Successfully installed PyMySQL-1.0.2
Note: you may need to restart the kernel to use updated packages.

In [48]:
from sqlalchemy import create_engine

In [50]:
str_conn='mysql+pymysql://root:tupassword@:3306/videoclub'


motor=create_engine(str_conn)

In [53]:
query1=pd.read_sql('''select f.title as 'TITULO',
                             f.length as 'DURACION'
                      from film f

                      order by f.length desc

                      limit 3;
                    ''', motor) #selección de las 3 peliculas mas largas

query1

           TITULO  DURACION
0     GANGS PRIDE       185
1  DARN FORRESTER       185
2   CHICAGO NORTH       185

In [55]:
query2=pd.read_sql('''select o.first_name as 'NOMBRE',
                             count(o.first_name) as 'NUMERO PELICULAS'
                      from old_HDD o

                      group by o.first_name
                      order by count(o.first_name) desc

                      limit 5;''', motor) #actores con mayor filmografia

query2

          NOMBRE  NUMERO PELICULAS
0        Unknown               386
1  SANDRA KILMER                37
2       UMA WOOD                35
3     VAL BOLGER                35
4  JULIA MCQUEEN                33

In [56]:
# Ahora que hemos visto que 'Unknown' es un actorazo, veamos cómo es la query verdaderamente valida
query2b = pd.read_sql('''select o.first_name as 'NOMBRE',
                               count(o.first_name) as 'NUMERO PELICULAS'
                        from old_HDD o

                        where o.first_name != 'Unknown'
                        group by o.first_name
                        order by count(o.first_name) desc

                        limit 5;

                    ''', motor)

query2b

          NOMBRE  NUMERO PELICULAS
0  SANDRA KILMER                37
1       UMA WOOD                35
2     VAL BOLGER                35
3   RIP CRAWFORD                33
4  JULIA MCQUEEN                33

In [58]:
query3 = pd.read_sql('''select l.name as 'IDIOMA',
                               count(f.language_id) as 'NUMERO DE PELICULAS'
                        from film f

                        left join language l
                        on f.language_id=l.language_id

                        order by count(f.language_id) desc

                        limit 5;

                    ''', motor) #idioma mas usado en las peliculas

query3

OperationalError: (pymysql.err.OperationalError) (1140, "In aggregated query without GROUP BY, expression #1 of SELECT list contains nonaggregated column 'videoclub.l.name'; this is incompatible with sql_mode=only_full_group_by")
[SQL: select l.name as 'IDIOMA',
                               count(f.language_id) as 'NUMERO DE PELICULAS'
                        from film f

                        left join language l
                        on f.language_id=l.language_id

                        order by count(f.language_id) desc

                        limit 5;

                    ]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [59]:
query4 = pd.read_sql('''select o.title as 'TITULO',
                               count(o.title) as 'NUMERO DE ACTORES'
                        from old_HDD o

                        group by o.title
                        order by count(o.title) desc

                        limit 3;''',motor) #peliculas con mayor reparto

query4

              TITULO  NUMERO DE ACTORES
0  BOONDOCK BALLROOM                  6
1  CONEHEADS SMOOCHY                  5
2         FLASH WARS                  5

In [62]:
query5 = pd.read_sql('''select f.title as 'TITULO DE LA PELICULA',
                           i.store_id as 'ID de la TIENDA',
                           f.rental_duration as 'DURACION DEL ALQUILER'
                    from film f

                    left join inventory i
                    on i.film_id=f.film_id

                    order by f.rental_duration desc
                    limit 5;

                    ''', motor) #Peliculas que más tiempo han estado alquiladas

query5

  TITULO DE LA PELICULA  ID de la TIENDA  DURACION DEL ALQUILER
0       BROOKLYN DESERT                1                      7
1     DECEIVER BETRAYED                1                      7
2       BROOKLYN DESERT                1                      7
3     DECEIVER BETRAYED                1                      7
4       BROOKLYN DESERT                1                      7

In [64]:
query6=pd.read_sql('''select c.name as 'CATEGORIA',
                             count(c.category_id) as 'NUMERO DE PELÍCULAS'
                    from old_HDD o

                    left join film f
                    on o.title = f.title

                    left join category c
                    on o.category_id = c.category_id

                    group by c.name
                    order by count(c.category_id) desc

                    limit 3;

                    ''',motor) #categorias con más películas

query6

   CATEGORIA  NUMERO DE PELÍCULAS
0     Sports                   79
1     Action                   77
2  Animation                   75

In [66]:
query7 = pd.read_sql('''select o.first_name as 'Nombre',
                           c.name as 'CATEGORIA',
                           count(c.name) as 'NUMERO DE PELÍCULAS'
                    from old_HDD o

                    left join actor a
                    on a.first_name = o.first_name

                    left join category c
                    on o.category_id = c.category_id

                    group by o.first_name, c.name
                    order by count(c.name) desc

                    limit 3;

                    ''', motor) #categorias en las que mas veces han actuado los actores

query7

          Nombre CATEGORIA  NUMERO DE PELÍCULAS
0   HELEN VOIGHT  Children                    7
1  JULIA MCQUEEN    Horror                    7
2   GRACE MOSTEL     Drama                    7

In [67]:
query8 = pd.read_sql('''select o.title as 'PELICULA',
                               max(f.replacement_cost) as 'COSTE DE SUSTITUCIÓN'
                        from old_HDD o

                        left join film f
                        on f.title = o.title

                        left join category c
                        on o.category_id = c.category_id

                        group by c.name
                        order by MAX(f.replacement_cost) desc

                        limit 3;

                    ''', motor) #peliculas mas costosas de reemplazar

query8

OperationalError: (pymysql.err.OperationalError) (1055, "Expression #1 of SELECT list is not in GROUP BY clause and contains nonaggregated column 'videoclub.o.title' which is not functionally dependent on columns in GROUP BY clause; this is incompatible with sql_mode=only_full_group_by")
[SQL: select o.title as 'PELICULA',
                               max(f.replacement_cost) as 'COSTE DE SUSTITUCIÓN'
                        from old_HDD o

                        left join film f
                        on f.title = o.title

                        left join category c
                        on o.category_id = c.category_id

                        group by c.name
                        order by MAX(f.replacement_cost) desc

                        limit 3;

                    ]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [68]:
query9 = pd.read_sql('''select c.name as 'CATEGORÍA',
                               sum(f.replacement_cost) as 'COSTE DE SUSTITUCIÓN'
                        from old_HDD o

                        left join film f
                        on f.title = o.title

                        left join category c
                        on o.category_id = c.category_id

                        group by c.name
                        order by MAX(f.replacement_cost) desc

                        limit 3;

                    ''', motor) #categorias que mas cuestan reemplazar

query9

  CATEGORÍA  COSTE DE SUSTITUCIÓN
0  Children               1150.38
1   Foreign               1180.36
2    Action               1541.23

In [70]:
query10 = pd.read_sql('''select c.name as 'CATEGORÍA',
                               sum(f.rental_rate)/count(f.rental_rate) as 'VALORACION'
                        from old_HDD o

                        left join film f
                        on f.title = o.title

                        left join category c
                        on o.category_id = c.category_id

                        group by c.name
                        order by sum(f.rental_rate)/count(f.rental_rate) desc

                        limit 3;''', motor) #categorias con mejor rental_rate

query10

  CATEGORÍA  VALORACION
0    Sci-Fi     3.61069
1    Travel     3.49000
2   Foreign     3.36500